Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_384-Glorious_King_of_Tantras_That_Resolves_All_Secrets-v1.tmx
Source language: bo
Languages: en

source: །ལྔ་པ་ནམ་མཁའ་ལྟ་བུ་ནི། །གཉིས་སུ་མེད་པ་བར་མ་དོའི། །མཚན་མ་སྟོང་པར་ཤེས་པར་བྱ།
en: The fifth, which resembles space, Should be understood as the empty sign For the intermediate state, non-duality.

source: །གཞན་ཡང་འདར་བ་ལ་སོགས་པ།
en: Moreover, vibrating and so forth

source: །དེ་ནས་གསང་བ་གསུམ་པ་ཡང་།
en: Next, concerning the third secret,

source: ། བརྒྱད་ལས་གཡས་གཡོན་ཆ་གཉིས་ཆ། །བཅུ་དྲུག་གྲངས་སུ་སྦས་པ་ཡིན།
en: Eight, divided into right and left parts Is concealed in the amount of sixteen.

source: །བརྒྱད་ལས་གཡས་གཡོན་སྟེང་འོག་བཞི། །སུམ་ཅུ་རྩ་གཉིས་གྲངས་སུ་སྦས།
en: Eight, with right, left, top, bottom, Is concealed in the amount of thirty-two.

source: །བརྒྱད་ལས་གཡས་གཡོན་སྟེང་འོག་བཞི། །མཚམས་བཞི་དང་ནི་བརྒྱད་ཀྱི་ཆ། །དྲུག་ཅུ་རྩ་བཞི་གྲངས་སུ་སྦས།
en: Eight divided into eight parts, with right, left, top, bottom, And four intermediate directions, Is concealed in the amount of sixty-four.

source: །ཚངས་མདོའི་མེ་ནི་མེ་ལ་སྦས།
en: The fire at the Brahma confluence is concealed in fire.

source: །སྙིང་ག་ཆོས་ཀྱི་འཁོར་ལོ་རུ། །ཆོས་ཀུན་རིག་པས་རིག་པ་སྦས།
en: In the dharma chakra at the heart all phenomena are known. Therefore, awareness is concealed there.

source: །དྲུག་ཅུ་རྩ་བཞི་ལས་ནི་ཟུང་། །སུམ་ཅུ་རྩ་གཉིས་གྲངས་སུ་སྦས།
en: Sixty-four, paired, Is concealed in the amount of thirty-two.

source: །དྲུག་ཅུ་རྩ་བཞི་ལས་ནི་བཞི། །བཅུ་དྲུག་གྲངས་སུ་སྦས་པ་ཡིན།
en: Sixty-four, grouped in fours, Is concealed in the amount of sixteen.

source: ། དྲུག་ཅུ་རྩ་བཞི་ལས་ནི་བརྒྱད། །བརྒྱད་ཀྱི་གྲངས་སུ་སྦས་པའོ།
en: Sixty-four, grouped in eights, Is concealed in the amount of eight.

source: །གཞང་ཁ་རླུང་ནི་རླུང་ལས་སྦས།
en: The wind of the anus is concealed within wind.

source: །གསང་བའི་གཏུམ་མོ་གཏུམ་མོར་སྦས།
en: The secret inner heat is concealed in the inner heat.

source: །འཁོར་ལོ་རེ་ལ་འཁོར་ལོ་བཞི། །ཕྱི་རུ་སྲོག་གི་རྣམ་པར་འཁྱུད།
en: On each chakra there are four chakras That externally clasp in the form of the life-force.

source: །ཆུ་དང་ཆུ་བྲན་ཆུ་བོ་རྣམས། །སྣ་ཚོགས་དུ་མར་འབབ་བྱེད་ཀྱང་།
en: Even though waters, streams, and rivers Are caused to flow in numerous ways,

source: །རྒྱ་མཚོ་ཆེན་པོར་རོ་གཅིག་འགྱུར།
en: In the ocean they become one flavor.

source: །ལྟེ་བར་རོལ་པ་བདེ་ཆེན་སྐུ།
en: Playing at the navel is the enlightened body of great bliss

source: །རྣམ་པར་ཐར་དང་སྟོང་པ་དང་། །དེ་བཞིན་མཚན་དང་དཔེ་བྱད་ལྡན།
en: Endowed with the liberations and emptinesses, And likewise the major and minor marks.

source: །སྙིང་ག་ཆོས་ཀྱི་སྐུ་ཡིན
en: At the heart is the dharma body,

source: །རྣམ་ཐར་ལ་སོགས་དེ་བཞིན་ནོ།
en: Likewise, with the liberations and so forth.

source: །མགྲིན་པ་ལོངས་སྤྱོད་དེ་དང་འདྲ།
en: Similarly, the enjoyment body is at the throat

source: །བདེ་ཆེན་སྤྲུལ་བའང་དེ་བཞིན་ནོ།
en: he emanation body is at the chakra of great bliss.

source: །མཚན་རྣམས་སྟེང་ལ་སྟོང་པ་འོག
en: The major marks above and emptiness below

source: །དང་པོའི་བདེ་ཆེན་ཁ་སྦྱོར་ཡིན།
en: Is the first union of great bliss.

source: །རྣམ་ཐར་སྟེང་ལ་དཔེ་བྱད་འོག
en: The liberations above and the minor marks below

source: །བདེ་ཆེན་ཁ་སྦྱོར་གཉིས་པ་ཡིན།
en: Is the second union of great bliss.

source: །གཞན་ནི་ཞལ་ལས་ཤེས་པར་བྱ།
en: The others should be learned orally.

source: །སྟོབས་བཅུ་རྣམ་དག་ཁ་སྦྱོར་བཅུ།
en: The pristine ten powers are the ten unions.

source: །རླུང་ནི་སྒྲོལ་མའི་ངོ་བོ་
en: Wind is the essence of Tārā,

source: །རྩ་དྲུག་དབུགས་ཀྱི་རང་བཞིན་གང་།
en: The nature of breath fills the six channels.

source: །མེ་ནི་གོས་དཀར་རང་བཞིན
en: Fire is the nature of Pāṇḍara­vāsinī,

source: །ཟུར་རྩ་གསུམ་ནི་དྲོད་ཀྱིས་གང་།
en: The three corner channels are filled with warmth.

source: །རང་བཞིན་གྱིས་ནི་གནས་པ་ལ། །བརྒྱད་དང་ལྔ་ཡི་མཚན་ཉིད་
en: Naturally present Are eight and five characteristics.

source: །བརྒྱད་ལ་དབྱངས་ཀྱི་དང་པོ་བརྒྱད།
en: The eight are the eight first vowels.

source: །ལྔ་ལ་ཀཱ་ལི་དང་པོ་ལྔ།
en: The five are the five first consonants,

source: །རིག་པའི་ཕོ་བྲང་མཐའ་ཅན་ལྔ།
en: The five suffix endings, the palace of knowledge.

source: །རྟ་མགྲིན་དབྱངས་ཡིག་གཡོན་དང་གཡས།
en: To the right and left of the vowel letter of Hayagrīva

source: །ཨ་གཉིས་མཐར་གཞག་འདབ་དགུ་ཡིན།
en: Are two a syllables, at the perimeter of which are nine petals.

source: །གསང་བའི་བདེ་སྐྱོང་འཁོར་ལོ་ནི།
en: At the chakra of the Secret Guardian of Bliss,

source: །མ་ནིང་བཞི་དང་ཨ་གཉིས་དབུས།
en: In the center of the four neuter letters and two a syllables

source: །བྱང་ཆུབ་སུམ་ཅུ་རྩ་བདུན་ཡིན།
en: Are the thirty-seven factors of enlightenment.

source: །དེ་ནས་རྩ་ཡི་མཚན་ཉིད་ཀྱང་།
en: Next, concerning the characteristics of the channels,

source: །སྐར་མའི་ཚོགས་ལྟར་དུ་མར་སྤྲོས་མོད་ཀྱང་།
en: Despite multiply radiating like a cluster of stars,

source: སྤྲིན་གྱི་རྣམ་པ་
en: cloudy form;

source: །དགའ་བ་བཞི་ཡི་མཚན་ཉིད
en: The characteristics of the four joys

source: དགའ་བའི་ངོ་བོ་ཡིན།
en: are the essence of joy.

source: །གསང་བ་རྡོ་རྗེ་རྩ་ལམ་ནས།
en: From the base of the secret vajra

source: །མཆོག་དགའ་ཡི་ནི་ངོ་བོ་
en: Is the essence of supreme joy.

source: །ལུས་འདར
en: the body vibrating

source: །གཞང་ལམ་གཡའ་
en: The anus quivering,

source: ་བ་སྤུ་ལྡང་།
en: body hairs rising,

source: །ཤེས་རབ་ཡེ་ཤེས་འབྲེལ་བ་
en: In connection with the wisdom-gnosis

source: །བྱང་ཆུབ་སེམས་རྒྱུ་བདེ་བ་སྙམ
en: Reflecting on the bliss of the spirit of enlightenment circulating

source: །རྡོ་རྗེ་པདྨ་འགགས་པ་སྙམ།
en: Reflecting on vajra and lotus stoppered

source: །ལྷན་ཅིག་སྐྱེས་པའི་ངོ་བོ་ཡིན།
en: Is the essence of innate joy.

source: །བདེ་བའི་རྒྱུན་ཆད་བདེ་བ་སྙམ།
en: Reflecting on the bliss of having the continuity of bliss interrupted

source: །བྲལ་བ་དགའ་བའི་ངོ་བོ་ཡིན།
en: Is the essence of the joy of cessation.

source: །འདི་རྣམས་ཀུན་གྱི་མཚན་ཉིད་ཀྱང་།
en: Moreover, the characteristics of all these,

source: །བྱང་ཆུབ་སེམས་ཕྱོགས་ལ་སོགས་པ།
en: Such as the factor of the spirit of enlightenment, and so forth,

source: །གོང་དུ་གསུངས་པར་ཤེས་པར་བྱ།
en: Should be understood in terms of what was taught above.

source: །དགའ་བ་སྣང་བ་ཞེས་བྱ་སྟེ།
en: Joy is called “luminance;”

source: །མཆོག་དགའ་སྣང་བ་མཆེད་པ་ཡིན།
en: Supreme joy is radiance.

source: །རབ་ཏུ་དགའ་བ་སྣང་བ་ཐོབ།
en: Extreme joy is imminence.

source: །ལྷན་ཅིག་སྐྱེས་པ་འོད་གསལ་བའོ།
en: Innate joy is clear light.

source: །ཡེ་ཤེས་བཞི་ཡི་རང་བཞིན་ཏེ། །བདུད་བཞི་འཇོམས་པའི་གཉེན་པོ་ཡིན།
en: The nature of the four gnoses Are the antidotes that destroy the four demons.

source: །རགས་པ་བཞི་ཡིས་གསང་བར་འཇོམས།
en: The coarse level is secretly destroyed by four.

source: །ཕྲ་བའི་བདུད་བཞི་རང་བཞིན་གྱིས། །འཁོར་ལོ་བཞི་རུ་འཇོམས་པ་ཡིན།
en: The four subtle demons are naturally Destroyed in the four chakras.

source: །འཁོར་ལོ་ལ་རྟེན་དགའ་བ་བཞི། །དེ་ཉིད་ཡེ་ཤེས་བཞི་རུ་སྣང་། །དེ་ཕྱིར་བདུད་བཞི་འཇོམས་པ་ཡིན།
en: The four joys based on the chakras Themselves appear as the four gnoses, And therefore destroy the four demons.

source: །འདོད་ཆགས་ལ་བརྟེན་དུག་གསུམ་ནི། །ཉོན་མོངས་པ་ཡི་བདུད་ཡིན་ཏེ། །འདོད་ཆགས་རྣམ་པ་བཅུ་གཉིས་ཡིན།
en: The three poisons based on desire Are the demon of afflictions, Involving twelve attributes of desire.

source: །གསང་བའི་བདེ་སྐྱོང་ཉོན་མོངས་འཇོམས།
en: The Secret Guardian of Bliss destroys the afflictions.

source: །ཁ་དོག་དབྱིབས་ནི་ཕུང་པོའི་བདུད།
en: Color and shape are the demon of the aggregates.

source: །རྟ་མགྲིན་འཁོར་ལོ་ཕུང་པོ་འཇོམས།
en: The Hayagrīva chakra destroys the aggregates.

source: །སྦས་པ་བཞི་ནི་ལྷ་ཡི་བདུད།
en: The four concealed things are the demon of the gods.

source: །རིག་པའི་འཁོར་ལོ་ལྷ་བདུད་འཇོམས།
en: The chakra of awareness destroys the demon of the gods.

source: །སྐྱེ་བ་དང་བཅས་འཆི་བ་སྟེ། །གསང་བ་སྐྱེ་མེད་འཆི་བདག་འཇོམས།
en: As for death, along with birth, The secret of their non-origination destroys the lord of death.

source: །ཕྲ་བའི་བདུད་འཇོམས་དེ་དང་འདྲ།
en: The destruction of the subtle demons is similar.

source: །སྐད་ཅིག་བཞི་དང་སྡེ་པ་བཞི།
en: the four moments and the four sections;

source: །བཟང་པོ་བཞི་དང་བདེན་པ་བཞི།
en: The four auspiciousnesses and the four truths;

source: །འབྱུང་བ་བཞི་དང་ཡུམ་བཞི་དང་།
en: The four elements and the four mothers;

source: །ཚངས་པའི་གནས་བཞི་ལ་སོགས་པ།
en: The four pure stations, and so forth—

source: །ཡེ་ཤེས་བཞི་པོ་འདི་ཉིད་ལས།
en: Apart from the four gnoses themselves

source: །ཁྱད་པར་གཞན་ནི་མི་འབྱུང་སྟེ།
en: There is nothing higher to be found.

source: །རྣམ་པར་རྟོག་པའི་བྱེ་བྲག་དང་། །གཞན་ཡང་མོས་པའི་བྱེ་བྲག་དང་། །ཆོས་ཚུལ་དུ་མའི་བྱེ་བྲག་གིས། །སྣ་ཚོགས་དུ་མར་གསུངས་པ་ཡིན།
en: It is due to the particularities of concepts And, furthermore, the particularities of inclinations And the particularities of various religious systems, That such a plethora has been taught.

source: །དབང་གསུམ་བགྲོད་པའི་རྣལ་འབྱོར་པ། །དགེ་སློང་ཆེན་པོར་གསུངས་པ་སྟེ། །འདི་ཡི་ཐམས་ཅད་བྱ་བར་གསུངས།
en: A practitioner who has traversed the three initiations Is taught to be a great, fully ordained monk. For it is taught that he will accomplish all.

source: །དགེ་སློང་དབང་གསུམ་ཇི་ལྟར་ལགས།
en: What is such a triple-initiation fully ordained monk like?

source: །དེ་ཡི་བྱ་བ་ཇི་ལྟ་བུ།
en: What are his activities?

source: ། གཅིག་དང་བཞི་དང་བཅུ་དང་ལྡན། །ཉིས་བརྒྱ་ལྔ་བཅུའི་གོ་རིམས་ཀྱིས།
en: According to the sequence of possessing One, four, ten, or two hundred and fifty vows,

source: །བསྙེན་གནས་དགེ་བསྙེན་དགེ་ཚུལ་དང་། །དགེ་སློང་སོ་སོར་ཐར་པ་ཡིན།
en: Temporary lay-vow holders, permanent lay-vow holders, novice monks, And fully-ordained monks, respectively, are those of individual liberation.

source: །དཀྱིལ་འཁོར་དུ་ཞུགས་དགེ་བ་སྟེ། །དེ་ལ་གནས་པ་བསྙེན་གནས་ཡིན།
en: Those who adhere to virtue Upon having entered the maṇḍala Are adherents of virtue, temporary lay-vow holders.

source: །བདུན་དང་ལྡན་ཕྱིར་ཆེན་པོ་ཡིན།
en: With seven, they are great.

source: །ཆེན་པོ་འདི་གསུམ་བྱེ་བྲག་ཀྱང་།
en: Concerning the particular three great ones,

source: །བུམ་པའི་དབང་ནི་དགེ་བ་སྟེ། །དེ་ལ་བསྙེན་པས་དགེ་བསྙེན་ཡིན།
en: By being in service to the virtue of the vase initiation, One is in the service of virtue, a permanent lay-vow holder.

source: །གསང་བའི་དབང་ནི་དགེ་བ་སྟེ། །དེ་ཡི་ཚུལ་ལྡན་དགེ་ཚུལ་ཡིན།
en: One who is in accordance with the virtue of the secret initiation Is in harmony with virtue, a novice.

source: །བདུན་དང་ལྡན་པས་ཆེན་པོ་ཡིན།
en: With seven, they become great.

source: །དགེ་བ་ཤེས་རབ་ཡེ་ཤེས་ཏེ། །དེ་ཉིད་སློང་བས་དགེ་སློང་ཡིན།
en: By upholding that very virtue of wisdom-gnosis, One is an upholder of virtue, a fully ordained monk.

source: །ཕྱིར་མི་ལྡོག་པ་གསུམ་ཡིན་ཏེ།
en: Are also the three non-returners,

source: །ཐེག་པ་གསུམ་གྱི་ཆ་ལུགས་ཀྱིས། །གསང་བ་སྤྱད་པར་མ་གསུངས་ཏེ།
en: I have not taught that one should perform secret conduct In the apparel of all three vehicles

source: འབྲས་བུ་འདི་གནས་རྣལ་འབྱོར་པ། །ཁྱིམ་པའམ་རྡོ་རྗེ་འཛིན་པ་ཡི། །ཆ་ལུགས་སུ་ནི་གནས་བྱས་ལ། །དབང་བསྐུར་རབ་གནས་ལ་སོགས་བྱ།
en: A practitioner who adheres to this fruition Should dwell in the apparel Of a house-holder, or a vajra-holder, And confer initiations, consecrations, and so forth.

source: །རྣམ་པར་སྨིན་དང་འཁོར་བ་དང་། །ཐེག་པ་དམན་པར་ལྡོག་པ་ནི།
en: In that reverting back to karmic maturation, cyclic existence, and the lower vehicle—

source: །སྤོང་བ་གསུམ་ནི་གོ་རིམས་བཞིན། །ཐེག་པ་གསུམ་གྱིས་ངེས་འབྱུང་ཞིང་། ། རིག་འཛིན་ཐེག་པ་འབྲས་བུར་གནས།
en: The three abandonments—are renounced by the three vehicles, respectively, And those of the knowledge-holder vehicle adhere to the fruition.

source: །དཔེར་ན་རྡོ་ལས་ཟངས་སུ་འགྱུར།
en: For example, copper is wrought from stone.

source: །ཟངས་ལས་གསེར་གྱི་རྣམ་པར་རོལ།
en: Based on copper, one can enjoy the appearance of gold.

source: །ཟངས་ཀྱི་དུས་ན་རྡོ་མེད་དོ།
en: When there is copper, there is no stone.

source: །གསེར་དུ་གྱུར་པས་རྡོ་མི་སྣང་།
en: By becoming golden, stone no longer appears.

source: །དེ་ནས་གསང་བ་བཞི་པོ་ཡང་། །བཞི་པའི་དབང་དང་འབྲེལ་བ་
en: Next, is the fourth secret, Related to the fourth initiation.

source: རྟག་ཏུ་གཡོ་བའི་སེམས་འདི་ཉིད། །གཟུགས་ལ་སོགས་པ་བཀུག་ནས་ནི། །བསྒོམ་བྱར་ལྷན་ཅིག་བཅས་པ་དག །དབང་དུ་བྱས་དེ་བསྒོམ་པར་བྱ།
en: Here one should meditate, having overcome This perpetually shifting mind itself, As well as its attendant objects of meditation— The forms and so forth that it latches onto.

source: །སྟོང་དང་མི་སྟོང་ལ་སོགས་པའི། །རྟོག་པ་བཅོམ་པས་མཁའ་ལྟར་འགྱུར།
en: Concepts of empty, not empty, and so forth, Are destroyed, leaving the mind like the sky.

source: །སེམས་ཉིད་སྟོང་པར་བཅུག་ནས་སུ། །སྟོང་པ་སེམས་སུ་རབ་བཅུག་ནས།
en: When the nature of mind is submerged within the empty, And the empty is well-submerged within the mind,

source: །རྟེན་ཡོད་མ་ཡིན་བརྟེན་པ་མེད།
en: There does not exist a support, there is nothing supported.

source: །དཔེ་མེད་གནས་ཀྱང་ཡོད་མ་ཡིན།
en: Even the matchless state does not exist.

source: རྣམ་སྨིན་གྱིས། །མནར་མེད་སེམས་ཅན་དམྱལ་བར་སྐྱེ།
en: by the fruition of these One will be born as a hell-being in Endless Torment.

source: ཕྱི་ནང་སྦས་དང་མཐར་ཐུག་གི། །དཀྱིལ་འཁོར་དུ་ཞུགས་དབང་མནོས་ནས། །བསྒོམ་དང་བཟླས་པ་ལ་སོགས་མེད། །གསང་སྔགས་བར་དུ་གཅོད་ཅིང་གཤེ།
en: If one enters the outer, inner, concealed, And ultimate maṇḍalas and obtains initiation, One must meditate, recite, and so forth, Lest one might obstruct and denigrate the secret mantra.

source: །རྣལ་འབྱོར་ཀུན་ལ་སྐུར་པ་འདེབས། །རྡོ་རྗེ་སྤུན་ཚིག་སློབ་ལ་འཕྱར། །རྩ་བ་ཡན་ལག་དམ་ཚིག་ཉམས། །བླ་མ་ལ་སྨོད
en: Disparaging any spiritual practice, Ridiculing vajra siblings, disciples with shared tantric commitments, Breaking the root and branch samaya vows, Cursing the lama

source: ང་ཡིས་བཤད།
en: I have explained

source: །རྩ་ཡི་འཁོར་ལོའི་དོན་མ་རྟོགས
en: not to understand The significance of the channel-chakras

source: །རྟེན་ཅིང་འབྲེལ་བ་ཟབ་མོ་ཡི།
en: Of profound interdependent origination

source: །ལྕགས་གྲི་སོར་ནི་བཅུ་དྲུག་པ། །འཛེག་པ
en: to straddle a blade sixteen finger-widths long.

source: །དགེ་སློང་ལ་སོགས་རྣམ་པ་གསུམ།
en: Fully ordained monks, and so forth, are three-fold:

source: །སོ་སོར་ཐར་དང་བྱང་ཆུབ་སེམས།
en: Individual liberation, bodhisattva,

source: །ཪིག་འཛིན་ཉིད་ཀྱི་དགེ་སློང་ངོ་།
en: And knowledge-holder fully ordained monks.

source: །གཏོང་དང་གཏོང་བ་ཆེན་པོ་དང་། །ཤིན་ཏུ་གཏོང་དང་རྣམ་པར་གཏོང་།
en: Those of generosity, great generosity, Extreme generosity and complete generosity

source: །བསྙེན་གནས་དགེ་བསྙེན་དགེ་ཚུལ་དང་། །དགེ་སློང་བྱང་ཆུབ་སེམས་དཔའ་ཡིན།
en: Are bodhisattva temporary lay-vow holders, permanent lay-vow holders, Novice monks and fully-ordained monks, respectively.

source: །སངས་རྒྱས་ཀྱིས་ཀྱང་མ་གསུངས་སོ།
en: The Buddha has not taught

source: །རིག་འཛིན་ཉིད་ཀྱི་དགེ་སློང་
en: A knowledge-holder fully ordained monk

source: །སོ་སོར་ཐར་དང་བྱང་ཆུབ་སེམས། །གཉིས་པོ་གནས་པ་ཉིད
en: embody both Individual liberation and bodhisattva vows.

source: སེམས་ཉིད་བསམ་དུ་མེད་པས་ན།
en: Since the nature of mind is inconceivable,

source: །ཅིར་ཡང་བསམ་པར་མི་བྱའོ།
en: One should not think of anything whatsoever.

source: །དེ་ཉིད་གནས་པ་རྫོགས་པ་སྟེ།
en: The perfected presence of precisely that

source: །ལྷན་སྐྱེས་གཉིས་མེད་རིག་པའོ།
en: Is innate non-dual awareness.

source: །ཕྱག་རྒྱ་ཆེན་པོར་ཡང་དག་བསྒོམས།
en: Having meditated authentically on the great seal,

source: །ཁྲོ་ཚུལ་གར་དང་ཕྱག་རྒྱ་རྣམས། །སྒྱུ་མ་ཙམ་དུ་མ་ཤེས་པར།
en: Without understanding that the wrathful dances And the seals are merely an illusory display,

source: །དུར་ཁྲོད་རྒྱལ་པོ་དྲེགས་པ་ཅན། །སྙིང་རྗེ་མེད་ཅིང་ཤ་ཁྲག་ཟ། ། དེ་ཡི་གནས་སུ་སྐྱེ་བར་འགྱུར།
en: One will be born as a haughty spirit— One of the kings of the eight charnel grounds— Devoid of compassion, an eater of flesh and blood.

source: །དམིགས་པ་ཐམས་ཅད་རྣམ་སྤངས་ཏེ།
en: Having fully relinquished all reference points

source: །གཟུང་བ་དང་ནི་འཛིན་པ་ཡི།
en: Of apprehended objects and apprehending subjects,

source: །གབ་པའི་གསང་བ་མ་རྟོགས་པ
en: one does not understand the hidden secret,

source: །སྦས་པ་མི་དམིགས་རྣམ་གསུམ་གྱིས།
en: Through the three-fold non-observation of the concealed

source: །ཐུར་དུ་སེམས་ཅན་དམྱལ་བར་སྐྱེ།
en: One will be born below as a hell being.

source: །ཤིང་རྟའི་འཁོར་ལོ་འཁོར་བ་ལྟར།
en: As the wheel of a cart revolves,

source: །ལས་ཀྱི་རྣམ་པར་སྨིན་པས་འཁོར།
en: So will one revolve due to the maturation of karma.

source: །དབྱིངས་དང་ཡེ་ཤེས་ལ་སོགས་པ།
en: Basic space and gnosis, and so forth—

source: །ལྟ་བའི་དོན་ཉིད
en: the very meaning of the view—

source: །ཤེས་པས
en: Through knowing

source: རང་གི་རང་རིག
en: ones’ own self-awareness‌,

source: །རང་རིག་
en: Self-awareness‌,

source: བདེ་བ་གང་འདོད་
en: whatever bliss is desired,

source: སྒྱུ་མར་གང་འདོད་པ།
en: whatever illusory display is desired,

source: ཤེལ་སྒོང་ལྟ་བུ་
en: like a crystal orb,

source: འཆད་པའོ།
en: Is thus resolved.

source: །རྒྱུད་ཀྱི་དོན་ནི་རྣམ་པ་གསུམ།
en: The meaning of tantra is threefold.

source: །བདེ་ཆེན་འཁོར་ལོ་རྒྱུ་ཡི་རྒྱུད།
en: The chakra of great bliss is the causal tantra;

source: །གསང་བའི་སྣ་རྩེ་ཐབས་ཀྱི་རྒྱུད།
en: The secret nose-tip is the means tantra;

source: །གསང་བ་བདེ་སྐྱོང་འབྲས་བུའི་རྒྱུད།
en: The Secret Guardian of Bliss is the fruitional tantra.

source: །བུམ་པ་རྒྱུ་ཡི་རྒྱུད་དུ་གསུངས།
en: The vase is taught to be the causal tantra;

source: །གསང་བ་ཐབས་ཀྱི་རྒྱུད་ཡིན་ཏེ།
en: The secret is the means tantra;

source: །ཤེས་རབ་ཡེ་ཤེས་འབྲས་བུའི་རྒྱུད།
en: The wisdom-gnosis is the fruitional tantra.

source: །སྐྱེ་བ་རྒྱུ་ཡི་རྒྱུད་དུ་གསུངས།
en: Birth is taught to be the causal tantra.

source: །འཆི་བ་ཐབས་ཀྱི་རྒྱུད་དུ་གསུངས།
en: Death is taught to be the means tantra.

source: །བར་མ་དོ་ནི་འབྲས་བུའི་རྒྱུད།
en: The intermediate state is the fruitional tantra.

source: །རྒྱུད་ཅེས་པ་ནི་རྒྱུན་ཡིན་ཏེ།
en: “Tantra” means continuum;

source: །གསང་བ་རྣམ་པ་བཞི་རུ་གསུངས།
en: Has taught secrets as four-fold.

source: །རྒྱལ་པོ་གསང་བ་སྟོན་པ་སྟེ།
en: Its king, which teaches secrets,

source: བུམ་པ་ལས་དང་པོ་ལ་གསང་།
en: The vase initiation is secret for beginners.

source: །གསང་བ་བུམ་པའི་དུས་སུ་གསང་།
en: At the time of the vase initiation, the secret initiation is secret.

source: །ཤེས་རབ་ཡེ་ཤེས་གསང་བར་གསང་།
en: Wisdom-gnosis is secret in the secret initiation.

source: །རང་རིག་ཤེས་རབ་ཡེ་ཤེས་གསང་།
en: Self-awareness‌ is secret in the wisdom-gnosis initiation.

source: །གསང་བའི་འཁོར་ལོ་བཞི་པའོ།
en: The secret chakra is the fourth secret.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེ་སྙིང་པོ་
en: Then, bodhisattva Vajragarbha

source: རི་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱིས
en: equal in number to the atoms in Mount Meru

source: མཁའ་འགྲོ་མའི་ཚོགས
en: an assembly of ḍākinīs

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་མི་སྣང་བར་གྱུར་ཏོ།
en: circumambulated the Blessed One three times and disappeared.

source: །དཔལ་གསང་བ་ཐམས་ཅད་གཅོད་པའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་རྫོགས་སོ།།
en: This concludes The Glorious King of Tantras That Resolves All Secrets.

source: ལོཙྪ་བ་དགེ་སློང་ཤཱཀྱ་ཡེ་ཤེས་
en: the translator bhikṣu Śākya Yeshé.

source: །།པཎྜི་ཏ་ག་ཡེ་དྷ་ར་
en: the paṇḍita Gayādhara

source: །དེ་ལྟར་ཡན་ལག་བཞི་ལྡན་པའི། །ལས་དང་པོ་ཡིས་
en: The beginner thus endowed with these four parts

source: རྣམ་རྟོག་སྤང་།
en: Will abandon concepts.

source: བཞི་རུ་གསུངས་པ་ཡིན།
en: are taught as four.
